{
    "admission": {
      "keywords": [
        "admission",
        "apply",
        "application",
        "form",
        "entrance",
        "counselling",
        "how to join",
        "eligibility",
        "process",
        "required document"
      ],
      "responses": [
        "Admissions are based on qualifying exam performance and entrance test scores like EAMCET, JEE, or college-level tests.",
        "You can apply online through the official college portal or in-person during the admission window.",
        "For engineering, students must have passed 10+2 with Physics, Chemistry, and Math.",
        "Counselling rounds are conducted for seat allotment. You all need original documents for verification.",
        "Management quota seats are also available. Contact the admission office for details.",
        "10th & 12th Mark Sheets ,Transfer Certificate (TC) ,Entrance Exam Rank Card ,Caste & Income Certificate (if applicable) Aadhaar Card, Passport-size photos"
      ]
    },
    "fees": {
      "keywords": [
        "fees",
        "fee structure",
        "tuition",
        "payment",
        "installments",
        "how much"
      ],
      "responses": [
        "The annual tuition fee varies by program. B.Tech typically ranges from 50,000 rupee to 1,20,000 rupee.",
        "Fees can be paid semester-wise or annually through online banking or at the accounts department.",
        "Separate fees apply for hostels, transportation, and special courses."
      ]
    },
    
    
    "hostel": {
      "keywords": [
        "hostel",
        "accommodation",
        "rooms",
        "mess",
        "living",
        "stay"
      ],
      "responses": [
        "Separate hostel facilities are available for boys and girls with 24/7 security.",
        "Room options include 2-seater, 3-seater with attached or common bathrooms.",
        "Nutritious food is provided in the mess with both North & South Indian options.",
        "Wi-Fi, reading rooms, and recreation areas are available in hostels.",
        "Hostel fee ranges from ₹30,000 to ₹60,000 annually depending on the room type."
      ]
    },
   "CampusLife_CampusLife": {
    "keywords": ["campus life"],
    "responses": [
      "Campus life at SVCET is vibrant and inclusive, offering students a balance of academics, events, and personal development."
    ]
  },
  "CampusLife_Facilities": {
    "keywords": ["facilities"],
    "responses": [
      "The campus offers excellent facilities including smart classrooms, advanced laboratories, seminar halls, and digital learning centers."
    ]
  },
  "CampusLife_Events": {
    "keywords": ["events"],
    "responses": [
      "The college hosts numerous events like tech fests, cultural festivals, workshops, seminars, and sports competitions throughout the year."
    ]
  },
  "CampusLife_Gym": {
    "keywords": ["gym"],
    "responses": [
      "Students have access to a well-equipped gym that supports fitness and physical wellness activities."
    ]
  },
  "CampusLife_Canteen": {
    "keywords": ["canteen"],
    "responses": [
      "The college canteen provides hygienic and affordable food with a variety of vegetarian and non-vegetarian options."
    ]
  },
  "CampusLife_Library": {
    "keywords": ["library"],
    "responses": [
      "The central library is spacious and resource-rich, offering physical and digital access to academic books, journals, and research materials."
    ]
  },
  "CampusLife_Infrastructure": {
    "keywords": ["infrastructure"],
    "responses": [
      "The college boasts modern infrastructure including Wi-Fi-enabled campus, smart classrooms, and specialized research labs."
    ]
  },
  "CampusLife_Environment": {
    "keywords": ["environment"],
    "responses": [
      "SVCET maintains a clean, green, and eco-friendly environment with landscaped gardens and sustainability practices."
    ] },
    
    "scholarship": {
      "keywords": [
        "scholarship",
        "fee reimbursement",
        "financial aid",
        "SC ST",
        "EBC",
        "minority",
        "merit"
      ],
      "responses": [
        "State government scholarships like E-PASS are available for SC, ST, BC, and minority students.",
        "Merit-based scholarships are awarded to top rankers and branch toppers.",
        "Students with family income below a certain threshold are eligible for fee reimbursement.",
        "Private scholarships from NGOs and corporates are encouraged.",
        "Documentation like income certificate, caste certificate, and marks memo are required for application."
      ]
    },
    
    "exam": {
      "keywords": [
        "exam",
        "internals",
        "mid",
        "final",
        "marks",
        "evaluation",
        "grading"
      ],
      "responses": [
        "Each semester includes two mid-exams and one final university exam.",
        "Internal assessment includes quizzes, assignments, and lab work.",
        "Final results are based on 40% internal and 60% external marks (may vary by university).",
        "Model papers and previous year questions are provided for exam prep.",
        "Students must maintain minimum 75% attendance to be eligible for exams."
      ]
    },
    "attendance": {
      "keywords": [
        "attendance",
        "percentage",
        "absent",
        "shortage",
        "medical",
        "condonation"
      ],
      "responses": [
        "Minimum 75% attendance is mandatory to write final exams.",
        "Condonation can be applied for attendance between 65%-74% with valid reason.",
        "Students with less than 65% are detained and need to repeat the semester.",
        "Daily attendance is tracked through biometric or manual registers.",
        "You can check your attendance via student portal or contact your class in-charge."
      ]
    },
    "doubtclearing": {
      "keywords": [
        "doubt",
        "clarification",
        "help",
        "tutoring",
        "remedial",
        "extra class"
      ],
      "responses": [
        "Faculty conduct weekly doubt-clearing sessions and remedial classes for slow learners.",
        "You can also meet subject faculty during office hours or after class.",
        "Peer tutoring sessions are conducted by senior students for tough subjects.",
        "Special care is given before exams to revise difficult concepts.",
        "Lab faculty also support students with hands-on doubts and project guidance."
      ]
    },
    "languageskills": {
      "keywords": [
        "english",
        "language lab",
        "communication",
        "soft skills",
        "public speaking"
      ],
      "responses": [
        "We have a dedicated English Language Lab for improving communication skills.",
        "Workshops on group discussions, resume writing, and mock interviews are conducted regularly.",
        "Soft skill training is part of the curriculum and conducted in 2nd and 3rd year.",
        "Students participate in activities like debates, JAM sessions, and storytelling.",
        "Fluency and confidence in English is essential for placement readiness."
      ]
    },
    "extracurricular": {
      "keywords": [
        "club",
        "dance",
        "music",
        "drama",
        "ncc",
        "nss",
        "robotics",
        "hackathon"
       
      ],
      "responses": [
        "Over 20+ clubs are active including Robotics, Dance, Music, Drama, and Coding Club.",
        "Students can participate in inter-college events, national-level competitions, and hackathons.",
        
        "NCC and NSS units promote discipline, service, and leadership.",
        "Annual fest 'Selesta2k23' showcases student talent across cultural and technical domains."
      ]
    },
    "antiragging": {
      "keywords": [
        "ragging",
        "anti ragging",
        "safety",
        "complaint",
        "helpline",
        "discipline"
      ],
      "responses": [
        "Our college has zero tolerance towards ragging in any form.",
        "Anti-ragging committees and squads conduct regular surveillance in hostels and campus.",
        "Students can report incidents anonymously through a helpline or portal.",
        "Strict disciplinary action including suspension and FIR may be taken against offenders.",
        "Awareness programs are conducted at the beginning of each academic year."
      ]
    },
    "alumni": {
      "keywords": [
        "alumni",
        "pass out",
        "old students",
        "graduates",
        "reunion",
        "network"
      ],
      "responses": [
        "Our alumni hold prestigious positions in MNCs, research institutions, and government organizations.",
        "The Alumni Cell regularly hosts reunions and invites alumni for guest lectures.",
        "Alumni mentorship helps current students with career guidance and higher studies.",
        "Many alumni support placement and internship opportunities for juniors.",
        "You can register in the alumni portal to stay connected with the college network."
      ]
    },"infrastructure": {
  "keywords": ["labs", "infrastructure", "classrooms", "wifi", "equipment", "facilities", "computers", "labs"],
  "responses": [
    "All departments are equipped with modern labs like Computer Labs, Electronics Labs, Mechanical Workshops, and Simulation Centers.",
    "The campus is fully Wi-Fi enabled with high-speed internet for academic and project use.",
    "Classrooms are smart-enabled with projectors, audio systems, and digital boards.",
    "The college maintains high standards in sanitation, drinking water, and green energy usage.",
    "Dedicated spaces for research and innovation such as IoT Labs, AI Labs, and Entrepreneurship Cells are also available."
  ]
},"parents": {
  "keywords": ["parents", "guardian", "hostel visit", "fees", "safety", "discipline", "contact", "support"],
  "responses": [
    "Parents are welcome to visit campus during working hours or on special Parent-Teacher Meet days.",
    "The administration maintains regular communication with parents regarding academic performance and attendance.",
    "24x7 student safety is ensured through security guards, CCTV cameras, and ID access systems.",
    "Fee payment can be done online or via bank transfer. Receipts are issued instantly for all transactions.",
    "In case of emergencies, parents can reach out to the Dean of Student Affairs or hostel wardens directly."
  ]
},"culturalFest": {
  "keywords": ["fest", "cultural", "events", "selesta", "celebration", "annual day", "competition", "talent show"],
  "responses": [
    "Our flagship cultural fest 'Selesta' attracts participants from colleges across the region, showcasing dance, music, drama, and fashion shows.",
    "We host annual celebrations like Freshers Day, Independence Day, Republic Day, and College Day with great enthusiasm.",
    "Competitions like Battle of Bands, Solo Singing, Street Play, and Quiz Night are popular among students.",
    "Celebrity appearances and DJ nights are often highlights of the Selesta fest.",
    "All departments also conduct technical and cultural mini-fests as part of student enrichment."
  ]
},"library": {
  "keywords": ["library", "books", "e-library", "digital library", "journals", "reading", "study space", "e-classroom"],
  "responses": [
    "Our central library houses thousands of academic and reference books, journals, and magazines across all departments.",
    "Students can access e-books, online journals, and databases like IEEE, Springer, and JSTOR from the digital library portal.",
    "Separate reading rooms are available for quiet study and group discussion.",
    "E-Classrooms are equipped with projectors, interactive boards, and internet for smart learning experiences.",
    "Library access is available from 8 AM to 8 PM on weekdays, and till noon on weekends."
  ]
},"sih": {
  "keywords": ["sih", "smart india hackathon", "hackathon", "coding event", "innovation", "challenge"],
  "responses": [
    "Smart India Hackathon (SIH) is a national-level competition where our students regularly participate and win accolades.",
    "Our college supports multiple student teams to build real-time solutions to industry problems under SIH.",
    "Dedicated mentoring and technical guidance are provided during the hackathon preparation phase.",
    "Past teams from our college have reached national finals and collaborated with government/industry bodies.",
    "Participation in SIH sharpens problem-solving, team coordination, and innovation skills."
  ]
},"nss": {
  "keywords": ["nss", "social work", "service", "community", "volunteer", "blood donation", "cleanliness drive"],
  "responses": [
    "Our NSS unit regularly conducts blood donation camps, village adoption programs, and environmental drives.",
    "Students can volunteer for social initiatives like tree planting, cleanliness missions, and health awareness campaigns.",
    "Participation in NSS activities adds value to your degree and cultivates civic responsibility.",
    "Certificates are awarded for NSS participation which help in placements and higher studies.",
    "We also collaborate with local NGOs and government bodies for community upliftment projects."
  ]
},"chapters": {
  "keywords": ["student chapter", "ieee", "iste", "club", "association", "technical society", "team"],
  "responses": [
    "We have active student chapters like IEEE, ISTE, CSI, IETE, SAE, and entrepreneurship cells.",
    "These chapters host regular workshops, tech talks, competitions, and industry expert sessions.",
    "Students gain hands-on project experience and certifications through club activities.",
    "Membership in student chapters enhances your resume and opens up networking opportunities.",
    "Leadership roles in clubs help build management, communication, and technical skills."
  ]
},"gym": {
  "keywords": ["gym", "fitness", "workout", "exercise", "bodybuilding", "training", "coach"],
  "responses": [
    "The college gymnasium is equipped with modern fitness machines for strength training and cardio.",
    "Professional coaches are available for personalized workout plans and group fitness sessions.",
    "Sports facilities include courts for cricket, volleyball, basketball, badminton, and a running track.",
    "Annual sports meets and inter-college tournaments provide students opportunities to compete and win awards.",
    "Students are encouraged to participate in yoga, Zumba, and meditation sessions for holistic wellness."
  ]
}, "Travell_Bus": {
    "keywords": ["bus"],
    "responses": [
      "The college operates a fleet of buses that connect major towns and localities for students and staff."
    ]
  },
  "Travell_Transport": {
    "keywords": ["transport"],
    "responses": [
      "Transport facilities are well-managed and available on all working days to ensure timely and safe commuting."
    ]
  },
  "Travell_Shuttle": {
    "keywords": ["shuttle"],
    "responses": [
      "Shuttle services are provided for specific routes during peak hours or for special campus events."
    ]
  },
  "Travell_CollegeBus": {
    "keywords": ["college bus"],
    "responses": [
      "College buses run on predefined routes with fixed timings for pickup and drop, ensuring student convenience."
    ]
  },
  "Travell_Pickup": {
    "keywords": ["pickup"],
    "responses": [
      "Designated pickup points across town make it easy for students to board the college buses on time."
    ]
  },
  "Travell_Drop": {
    "keywords": ["drop"],
    "responses": [
      "College buses provide timely drop service to ensure students reach home safely after classes."
    ]
  },
  "Travell_Route": {
    "keywords": ["route"],
    "responses": [
      "Detailed bus routes and stop locations are published on the college notice board and website."
    ]
  },
  "Travell_Travel": {
    "keywords": ["travel"],
    "responses": [
      "The college ensures hassle-free travel with organized transport schedules, safety measures, and proper bus maintenance."
    ]
  }
  ,  "college_evaluation": {
    "keywords": [
      "ranking",
      "accreditation",
      "reputation",
      "faculty",
      "facilities",
      "good",
      "placement",
      "student satisfaction",
      "industry connections",
      "extracurricular",
      "research"
    ],
    "responses": [
      "Our college is accredited and ranked among the top institutions, ensuring high-quality education.",
      "Experienced faculty members mentor students and engage in cutting-edge research.",
      "State-of-the-art facilities, including libraries, labs, and sports complexes, enhance student learning.",
      "Strong placement records with top recruiters and industry partnerships benefit graduates.",
      "Active student clubs, cultural fests, and extracurricular activities promote a vibrant campus life.",
      "Our alumni network and collaborations with leading industries provide career opportunities and hands-on learning."
    ]
  }
,"greeting": {
    "keywords": [
      
      "hi",
      "Hi",
      "Hii",
      "hii",
      "Hello",
      "hello"
      
    ],
    "responses": [
  "Hello! How can I help you today with your college inquiries?",
  "Hi there! Feel free to ask me anything about admissions, academics, or campus life.",
  "Hey! I'm here to assist you with any questions about our college.",
  "Greetings! Need information on courses, fees, or placements? I'm ready to help!",
  "Hi! Looking for details about our programs or facilities? Just ask!"
]
  },"Question": {
    "keywords": [
      
      "self introduction",
      "who are you?",
      "your name",
      "name",
      "you",
      "yourself"
      
    ],
    "responses": [
  "I'm Dev, your friendly virtual assistant created to help with all your queries about Sri Venkateswara College of Engineering and Technology! "
  
]},"Sport":{
  "keywords":[
    "sport","Sport",
    "sports","Sports",
    "Games","games"
    ,"Game","game"
  ],
  "responses":[
    "At Sri Venkateswara College of Engineering and Technology, we strongly encourage students to stay active and participate in sports! 🏆\n\nHere is what we offer in terms of sports facilities:\n\n- 🏏 Cricket Ground  Full-sized and well-maintained for matches and practice.\n- ⚽ Football Ground – Perfect for team games and tournaments.\n- 🏀 Basketball Court  For both casual play and competitive events. 🏐 Volleyball Court  Regular inter-college matches are held here.\n- 🏸 Badminton Court – Both indoor and outdoor options available.\n- 🥋 Kabaddi Ground  A popular choice among students.\n- 🎯 Indoor Games Rooms  Equipped for chess, carroms, table tennis, and more!Whether you're a seasoned player or just looking to have fun and stay fit there is something for everyone!  Let me know if you would like info about sports teams events or joining a club."
  ]
},"Opion": {
      "keywords": [
        "Student opion ",
        "opion ",
        "Opion",
        "View"
      ],
      "responses": [
"The faculty is really supportive and the curriculum is up-to-date with current industry trends. Labs are well-equipped too.",       
"Campus life is vibrant with lots of cultural and tech fests. It's a great place to explore extracurricular activities."        ,
"Placements are decent, especially for CS and IT. Core branches get fewer opportunities, but internships help bridge the gap."      ]
      },
        "Location": {
          "keywords": [
            "location",
            "located",
            "place",
            "placed",
            "where is the college"
          ],
          "responses": [
            "The College is located on highway in an area of 65 Acre of  sceniec beauty at R V S Nagar , Chittoor(AP).The College is located 7 Km from Chittoor and 60 km from Tirupati ."
          ]
        },"CampusSize": {
    "keywords": [
      "campus size",
      "area of college",
      "how big is the campus",
      "college area",
      "campus area"
    ],
    "responses": [
      "The College is located on highway in an area of 65 Acre of  sceniec beauty at R V S Nagar , Chittoor(AP).The College is located 7 Km from Chittoor and 60 km from Tirupati ."
    ]
  },
    "CampusArea": {
      "keywords": [
        "campus area",
        "campus size",
        "area of college",
        "how big is the campus",
        "college area",
        "campas area"
      ],
      "responses": [
        "The college campus spans across 65 acres, providing a spacious and green environment ideal for academics, sports, and student activities."
      ]
    }
    ,"Fee_CSE": {
    "keywords": [
      "cse fee",
      "computer science fee",
      "fee for cse",
      "cse branch fee"
    ],
    "responses": [
      "The annual fee for Computer Science Engineering (CSE) is ₹1,20,000."
     
    ]
  },"All_CSE": {
    "keywords": [
      "All fee",
      "fee structure",
      "fee"
    ],
    "responses": [
      "The annual fee for Computer Science Engineering (CSE) is ₹1,20,000\n.Here \nis the branch-wise annual fee structure:\n• Computer Science Engineering (CSE): ₹1,20,000\n• Information Technology (IT): ₹1,00,000\n• Computer & Artificial Intelligence (CAI): ₹1,05,000\n• Electronics and Communication Engineering (ECE): ₹95,000\n• Electrical and Electronics Engineering (EEE): ₹90,000\n• Mechanical Engineering (ME): ₹85,000\n• Civil Engineering: ₹80,000\n\nNote: The fee may vary slightly for management quota admissions. Concessions and scholarships are available for differently-abled students based on eligibility."
     
    ]
  },
  "Fee_IT": {
    "keywords": [
      "it fee",
      "information technology fee",
      "fee for it",
      "it branch fee"
    ],
    "responses": [
      "The annual fee for Information Technology (IT) is ₹1,00,000.",
      "Note: The fee may vary slightly for management quota admissions. Concessions are available for differently-abled students."
    ]
  },
  "Fee_CAI": {
    "keywords": [
      "cai fee",
      "artificial intelligence fee",
      "fee for cai",
      "computer and ai fee"
    ],
    "responses": [
      "The annual fee for Computer & Artificial Intelligence (CAI) is ₹1,05,000.",
      "Note: The fee may vary slightly for management quota admissions. Concessions are available for differently-abled students."
    ]
  },
  "Fee_ECE": {
    "keywords": [
      "ece fee",
      "electronics and communication fee",
      "fee for ece",
      "ece branch fee"
    ],
    "responses": [
      "The annual fee for Electronics and Communication Engineering (ECE) is ₹95,000.",
      "Note: The fee may vary slightly for management quota admissions. Concessions are available for differently-abled students."
    ]
  },
  "Fee_EEE": {
    "keywords": [
      "eee fee",
      "electrical engineering fee",
      "fee for eee",
      "eee branch fee"
    ],
    "responses": [
      "The annual fee for Electrical and Electronics Engineering (EEE) is ₹90,000.",
      "Note: The fee may vary slightly for management quota admissions. Concessions are available for differently-abled students."
    ]
  },
  "Fee_MECH": {
    "keywords": [
      "mechanical fee",
      "mech fee",
      "fee for mechanical",
      "me branch fee"
    ],
    "responses": [
      "The annual fee for Mechanical Engineering (ME) is ₹85,000.",
      "Note: The fee may vary slightly for management quota admissions. Concessions are available for differently-abled students."
    ]
  },
  "Fee_CIVIL": {
    "keywords": [
      "civil fee",
      "civil engineering fee",
      "fee for civil",
      "civil branch fee"
    ],
    "responses": [
      "The annual fee for Civil Engineering is ₹80,000.",
      "Note: The fee may vary slightly for management quota admissions. Concessions are available for differently-abled students."
    ]
  },
    "Course_Course": {
      "keywords": ["course"],
      "responses": [
        "We offer a variety of undergraduate and postgraduate courses tailored to industry needs, including B.Tech, MBA, and specialized programs.We offer branches such as Computer Science, ECE, Mechanical, Civil, AI-DS, IT, and more, with flexibility to explore interdisciplinary learning."
      ]
    },
    "Course_Curriculum": {
      "keywords": ["curriculum"],
      "responses": [
        "The curriculum is AICTE-approved and regularly updated to stay in sync with current industry trends and technologies."
      ]
    },
    "Course_Syllabus": {
      "keywords": ["syllabus"],
      "responses": [
        "The full syllabus is available on the academic portal and covers both core subjects and electives. It’s structured for both theoretical and practical learning."
      ]
    },
    "Course_Branches": {
      "keywords": ["branches"],
      "responses": [
        "We offer branches such as Computer Science, ECE, Mechanical, Civil, AI-DS, IT, and more, with flexibility to explore interdisciplinary learning."
      ]
    },
    "Course_Departments": {
      "keywords": ["departments"],
      "responses": [
        "Our departments include Computer Science, Electronics & Communication, Electrical, Mechanical, Civil, AI-DS, IT, and Management Studies."
      ]
    },
    "Course_Programs": {
      "keywords": ["programs"],
      "responses": [
        "Programs include B.Tech, MBA, and domain-focused tracks in AI, IoT, Cybersecurity, and more to prepare students for future-ready careers."
      ]
    },
    "Course_Subjects": {
      "keywords": ["subjects"],
      "responses": [
        "Core and elective subjects include Data Structures, Machine Learning, Digital Electronics, Fluid Mechanics, and more, depending on the branch."
      ]
    },
    "Course_BTech": {
      "keywords": ["BTech"],
      "responses": [
        "The B.Tech program spans 4 years with a strong focus on engineering fundamentals, lab work, projects, internships, and elective choices."
      ]
    },
    "Course_MBA": {
      "keywords": ["MBA"],
      "responses": [
        "The MBA program focuses on leadership, marketing, finance, HR, and includes case studies, internships, and industry interactions."
      ]
    }
  ,"Faculties_Info": {
  "keywords": ["faculty", "faculties", "teachers", "staff", "professors", "hod", "instructors"],
  "responses": [
    "Our college has experienced and qualified faculty across all departments. Professors hold M.Tech, Ph.D., and other advanced degrees, and many are involved in active research and mentoring.",
    "Faculty members are approachable and dedicated to guiding students both academically and professionally. Each department is headed by a senior professor with vast experience.",
    "Departments like CSE, ECE, and MECH have faculty specialized in areas like AI, VLSI, Thermal Engineering, and more. Regular guest lectures and industry sessions are also conducted by experts."
  ]
 }
 ,"Extracurricular_Extracurricular": {
    "keywords": ["extracurricular"],
    "responses": [
      "Our college promotes a healthy balance of academics and extracurricular activities to ensure all-round development of students."
    ]
  },
  "Extracurricular_Clubs": {
    "keywords": ["clubs"],
    "responses": [
      "We have various student-run clubs like coding club, dance club, music club, drama club, and photography club that conduct regular sessions and events."
    ]
  },
  "Extracurricular_Activities": {
    "keywords": ["activities"],
    "responses": [
      "Students can participate in technical workshops, seminars, social outreach programs, hackathons, and more organized throughout the academic year."
    ]
  },
  "Extracurricular_Sports": {
    "keywords": ["sports"],
    "responses": [
      "Sports facilities are available for cricket, football, volleyball, badminton, athletics, and indoor games. Annual sports meet is a major highlight."
    ]
  },
  "Extracurricular_Events": {
    "keywords": ["events"],
    "responses": [
      "Numerous events such as tech fests, cultural nights, seminars, and inter-college competitions keep the campus lively and engaging."
    ]
  },
  "Extracurricular_Cultural": {
    "keywords": ["cultural"],
    "responses": [
      "Cultural programs include dance, music, drama, and traditional arts. Students regularly perform during college day and cultural fests."
    ]
  },
  "Extracurricular_Fest": {
    "keywords": ["fest"],
    "responses": [
      "Annual fests like college day, cultural fest, and technical symposiums bring students together for celebration and learning."
    ]
  },
  "Extracurricular_Games": {
    "keywords": ["games"],
    "responses": [
      "The campus offers space and equipment for various indoor and outdoor games, encouraging students to stay active and competitive."
    ]
  }, "General_Autonomous": {
    "keywords": ["autonomous", "affiliation", "status"],
    "responses": [
      "Yes, SVCET is an autonomous institution."
    ]
  },
  "General_AdmissionProcess": {
    "keywords": ["admission", "application", "process", "apply"],
    "responses": [
      "Admissions at SVCET are conducted through Common Entrance Tests like EAPCET for UG programs, PGECET for M.Tech, and ICET for MBA and MCA programs. The state government follows a centralized admission procedure for the Convener Quota. For detailed information, please visit our admission process page."
    ]
  },
  "General_EligibilityBTech": {
    "keywords": ["eligibility", "B.Tech", "qualifications", "criteria"],
    "responses": [
      "Candidates must have a minimum of 50% in 10+2 (Intermediate) with Mathematics, Physics, and Chemistry as compulsory subjects to be eligible for B.Tech programs at SVCET."
    ]
  },
  "General_ManagementQuota": {
    "keywords": ["management quota", "Category-B", "seats"],
    "responses": [
      "Yes, 30% of the total seats are under Category-B (Management Quota) and are filled by the college management as per guidelines of APSCHE."
    ]
  },
  "Facilities_Hostel": {
    "keywords": ["hostel", "accommodation", "facilities"],
    "responses": [
      "Yes, SVCET provides hostel accommodation for both boys and girls. The hostels are situated just 0.5 km from the college, with bus facilities available between the college and hostel. The boys' hostel has 269 rooms, and the girls' hostel has 129 rooms, equipped with necessary amenities."
    ]
  },
  "Facilities_Sports": {
    "keywords": ["sports", "gymnasium", "facilities"],
    "responses": [
      "SVCET offers various sports facilities, including a well-equipped gymnasium with modern equipment like 20 individual stations and 2 multi-stations."
    ]
  },
  "Facilities_Transport": {
    "keywords": ["transport", "bus", "services"],
    "responses": [
      "Yes, SVCET offers bus facilities for students between the college and hostels, ensuring convenient transportation."
    ]
  },
  "Facilities_Library": {
    "keywords": ["library", "resources", "books"],
    "responses": [
      "Yes, SVCET has a central library equipped with a vast collection of books, journals, and digital resources to support students' academic needs."
    ]
  },
  "Facilities_AntiRagging": {
    "keywords": ["anti-ragging", "safety", "measures"],
    "responses": [
      "SVCET has a strict anti-ragging policy to ensure the safety and well-being of all students on campus."
    ]
  }, "Placement_Record": {
    "keywords": ["placement", "record", "jobs", "employment"],
    "responses": [
      "SVCET has a commendable placement record with numerous students placed in reputed companies over the years. For detailed placement records, please visit our placement record page."
    ]
  },
  "Placement_Companies": {
    "keywords": ["companies", "recruiters", "placement companies"],
    "responses": [
      "Top companies like Infosys, TCS, Wipro, Cognizant, Accenture, Capgemini, Tech Mahindra, and IBM have visited SVCET for campus placements. Several startups and core companies also recruit students from various engineering and management streams."
    ]
  },"Placement_Career": {
    "keywords": ["career"],
    "responses": [
      "Our Career Services team offers career counseling, resume-building workshops, interview coaching, and exclusive job fairs."
    ]
  },
  "Placement_Internship": {
    "keywords": ["internship"],
    "responses": [
      "We collaborate with industry leaders to provide internship placements in technology, healthcare, finance, and government sectors."
    ]
  },
  "Placement_Job": {
    "keywords": ["job", "employment"],
    "responses": [
      "Graduates achieve a strong placement rate, with recruiters including multinational corporations and top startups."
    ]
  },
  "Placement_Company": {
    "keywords": ["company", "industry", "hire"],
    "responses": [
      "Annual placement drives bring over 150 esteemed recruiters to hire talented students."
    ]
  },
  "Placement_Salary": {
    "keywords": ["salary"],
    "responses": [
      "Competitive salary packages are secured by graduates, reflecting high demand for their skills across industries."
    ]
  },
  

   "default": [
      "I'm not sure I understand your question. Could you provide more details or ask about a specific aspect of the university?"
    ]
  
}
